app/controllers/api/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def destroy
    @applications = Application.all
    @application = Application.find(params[:id])
    @application.destroy
---
SELECT "applications".* FROM "applications"
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 3]]

def update
  user_application = Application.find(params[:id])
  user_application.update(
    primary_field: params[:primary_field],
    secondary_field: params[:secondary_field],
    background_color: params[:background_color],
    description: params[:description],
    font: params[:font],
    display_theme: params[:display_theme],
    img_url: params[:img_url],
    app_name: params[:app_name]
  )
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "applications" SET "primary_field" = NULL, "secondary_field" = NULL, "background_color" = NULL, "description" = NULL, "font" = NULL, "display_theme" = NULL, "img_url" = NULL, "app_name" = NULL WHERE "applications"."id" = ?  [["id", 1]]

def show
  user_application = Application.find(params[:id])

  fields = user_application.fields
  records = user_application.records
  app_id = params[:id]

  fieldsWithKey ={}
  fields.each do |field|
    fieldID = field.id
    fieldsWithKey[fieldID] = field
  end
  # recordIDArray = Record.select(:id).where(:application_id => app_id)

  # resultArray =[]
  # recordIDArray.each do |record|
  # resultArray.push(Value.where(:record_id => record.id))
  # end
  # resultarray2 = resultArray.flatten(1)
  recordIDArray = Record.where(:application_id => app_id)

  object = {}
  resultArray =[]
  recordIDArray.each do |record|

    values = Value.where(:record_id => record.id)
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 1]]
SELECT "fields".* FROM "fields" WHERE "fields"."application_id" = ?  [["application_id", 1]]
SELECT "records"."id" FROM "records" WHERE "records"."application_id" = ?  [["application_id", 1]]
SELECT "values".* FROM "values" WHERE "values"."record_id" = ?  [["record_id", 1]]

def recordBySelectedFields
  user_application = Application.find(params[:id])

  fields = user_application.fields
  records = user_application.records.select(:id, :position)
  app_id = params[:id]

  fieldsWithKey ={}
  primaryId = fields.select(:id).where(field_name: user_application.primary_field)
  secondaryId = fields.select(:id).where(field_name: user_application.secondary_field)
  recordIDArray = Record.where(:application_id => app_id)
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", nil]]
SELECT "records".* FROM "records" WHERE "records"."application_id" = ?  [["application_id", 1]]