app/controllers/api/fields_controller.rb

SELECT "fields".* FROM "fields"
---
    def index
        @fields = Field.all

SELECT "fields".* FROM "fields"
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "fields" WHERE "fields"."id" = ?  [["id", 1]]
---
    def destroy
        @fields = Field.all
        @field = Field.find(params[:id])

        # remove selected primary/secondary field if that field is deleted. Did it this way because no time to adjust the schema at this time.
        deleted_field_name = @field.field_name
        application_ID = @field.application_id
        application = Application.find(application_ID)
        if application.primary_field === deleted_field_name
            application.update(primary_field: "")
        end
        if application.secondary_field === deleted_field_name
            application.update(secondary_field: "")
        end

        @field.destroy

INSERT INTO "fields" ("field_name", "field_type", "application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["field_name", "New Column"], ["field_type", "String"], ["application_id", 1], ["created_at", "2022-02-16 05:20:40.668663"], ["updated_at", "2022-02-16 05:20:40.668663"]]
SELECT "records".* FROM "records" WHERE "records"."application_id" = ?  [["application_id", 1]]
---
    def create
        field = Field.create(
            field_name: params[:field_name],
            field_type: params[:field_type],
            application_id: params[:application_id]
            )
        records = Record.where(application_id: params[:application_id])

SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "fields" SET "field_name" = 'Building', "field_type" = NULL WHERE "fields"."id" = ?  [["id", 1]]
---
    def update
       field = Field.find(params[:id])
       p params
       field.update(record_params)