app/controllers/api/records_controller.rb

  def index
    @records = Record.all
---
SELECT "records".* FROM "records"

  def create
    records = Record.create(
        position: params[:position],
        application_id: params[:application_id]
    )

    allfields = Field.where(application_id: params[:application_id] )
---
INSERT INTO "records" ("position", "application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["position", 0], ["application_id", 1], ["created_at", "2022-02-16 01:53:51.417935"], ["updated_at", "2022-02-16 01:53:51.417935"]]
SELECT "fields".* FROM "fields" WHERE "fields"."application_id" = ?  [["application_id", 1]]

  def destroy
    records = Record.all
    record = Record.find(params[:id])
    record.destroy
---
SELECT "records".* FROM "records"
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]