app/controllers/api/values_controller.rb

SELECT "values".* FROM "values"
---
  def index
    @values = Value.all

SELECT  "values".* FROM "values" WHERE "values"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "values" SET "field_value" = 'Strawb11122123123132123' WHERE "values"."id" = ?  [["id", 1]]
---
  def update
    value = Value.find(params[:id])
    value.update_columns(
      field_value: params[:field_value]
    )