app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def destroy
    @applications = Application.all
    @application = Application.find(params[:id])
    @application.destroy
---
SELECT "applications".* FROM "applications"
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 2]]

def create
  @applications = Application.create(
      primary_field: params[:primary_field],
      secondary_field: params[:secondary_field],
      background_color: params[:background_color],
      description: params[:description],
      font: params[:font],
      display_theme: params[:display_theme],
      img_url: params[:img_url],
      app_name: params[:app_name],
      user_id: params[:user_id]
  )
---
INSERT INTO "applications" ("primary_field", "secondary_field", "background_color", "description", "font", "display_theme", "img_url", "app_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def show
  user_application = Application.find(params[:id])

  fields = user_application.fields
  records = user_application.records
  app_id = params[:id]
  recordIDArray = Record.select(:id).where(:application_id => app_id)

  resultArray =[]
  recordIDArray.each do |record|
  resultArray.push(Value.where(:record_id => record.id))
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "records"."id" FROM "records" WHERE "records"."application_id" = ?  ORDER BY "records"."id" ASC LIMIT 1  [["application_id", 1]]
SELECT "records".* FROM "records" WHERE "records"."application_id" = ?  [["application_id", 3]]
SELECT "values".* FROM "values" WHERE "values"."record_id" = ?  [["record_id", 1]]