app/controllers/fields_controller.rb

SELECT "fields".* FROM "fields"
---
    def index
        @fields = Field.all

SELECT "fields".* FROM "fields"
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "fields" WHERE "fields"."id" = ?  [["id", 8]]
---
    def destroy
        @fields = Field.all
        @field = Field.find(params[:id])
        @field.destroy

INSERT INTO "fields" ("field_name", "field_type", "application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["field_name", "Price"], ["field_type", "Integer"], ["application_id", 3], ["created_at", "2022-02-13 03:02:58.781284"], ["updated_at", "2022-02-13 03:02:58.781284"]]
SELECT "records".* FROM "records" WHERE "records"."application_id" = ?  [["application_id", 1]]
SELECT "records".* FROM "records"
---
    def create
        field = Field.create(
            field_name: params[:field_name],
            field_type: params[:field_type],
            application_id: params[:application_id]
            )
        records = Record.where(application_id: params[:application_id])
        unless records.nil?
            records.each do |record|

SELECT  "fields".* FROM "fields" WHERE (8) LIMIT 1
UPDATE "fields" SET "field_name" = 'Address', "field_type" = 'String' WHERE "fields"."id" = ?  [["id", 1]]
---
    def update
       @field = Field.find_by(params[:id])
       @field.update_columns(field_name: params[:field_name], field_type: params[:field_type])