app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT "records".* FROM "records"

  def create
    records = Record.create(
        position: params[:position],
        application_id: params[:application_id]
    )

    allfields = Field.where(application_id: params[:application_id] )
---
INSERT INTO "records" ("position", "created_at", "updated_at") VALUES (?, ?, ?)  [["position", 5], ["created_at", "2022-02-14 18:07:01.998891"], ["updated_at", "2022-02-14 18:07:01.998891"]]
SELECT "fields".* FROM "fields" WHERE "fields"."application_id" IS NULL