app/controllers/values_controller.rb

  def index
    @values = Value.all
---
SELECT "values".* FROM "values"